In [1]:
import pandas as pd 
import numpy as np 

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [2]:
n_rows = 5 
n_cols = 2 
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

AttributeError: module 'pandas.util' has no attribute 'testing'

In [3]:
df.dtypes

bil_pecahan    float64
bil_bulat        int32
dtype: object

In [4]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         18.0          2
1          4.0         14
2         18.0         14
3          7.0          5
4          7.0         10

In [5]:
df.select_dtypes(include='float')

   bil_pecahan
0         18.0
1          4.0
2         18.0
3          7.0
4          7.0

In [6]:
df.select_dtypes(include='int')

   bil_bulat
0          2
1         14
2         14
3          5
4         10

In [7]:
df.select_dtypes(include='object')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [8]:
df.select_dtypes(include='datetime')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [9]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat
0         18.0          2
1          4.0         14
2         18.0         14
3          7.0          5
4          7.0         10